GopalSaraf/Practicals/PSDL/include/proc/pic16lf1906.inc
// Register: PMDATH
#define PMDATH PMDATH
PMDATH                                   equ 0194h
// bitfield definitions
PMDATH_PMDATH_POSN                       equ 0000h
PMDATH_PMDATH_POSITION                   equ 0000h
PMDATH_PMDATH_SIZE                       equ 0006h
PMDATH_PMDATH_LENGTH                     equ 0006h
PMDATH_PMDATH_MASK                       equ 003Fh

// Register: PMCON1
#define PMCON1 PMCON1
PMCON1                                   equ 0195h
// bitfield definitions
PMCON1_RD_POSN                           equ 0000h
PMCON1_RD_POSITION                       equ 0000h
PMCON1_RD_SIZE                           equ 0001h
PMCON1_RD_LENGTH                         equ 0001h
PMCON1_RD_MASK                           equ 0001h
PMCON1_WR_POSN                           equ 0001h
PMCON1_WR_POSITION                       equ 0001h
PMCON1_WR_SIZE                           equ 0001h
PMCON1_WR_LENGTH                         equ 0001h
PMCON1_WR_MASK                           equ 0002h
PMCON1_WREN_POSN                         equ 0002h
PMCON1_WREN_POSITION                     equ 0002h
PMCON1_WREN_SIZE                         equ 0001h
PMCON1_WREN_LENGTH                       equ 0001h
PMCON1_WREN_MASK                         equ 0004h
PMCON1_WRERR_POSN                        equ 0003h
PMCON1_WRERR_POSITION                    equ 0003h
PMCON1_WRERR_SIZE                        equ 0001h
PMCON1_WRERR_LENGTH                      equ 0001h
PMCON1_WRERR_MASK                        equ 0008h
PMCON1_FREE_POSN                         equ 0004h
PMCON1_FREE_POSITION                     equ 0004h
PMCON1_FREE_SIZE                         equ 0001h
PMCON1_FREE_LENGTH                       equ 0001h
PMCON1_FREE_MASK                         equ 0010h
PMCON1_LWLO_POSN                         equ 0005h
PMCON1_LWLO_POSITION                     equ 0005h
PMCON1_LWLO_SIZE                         equ 0001h
PMCON1_LWLO_LENGTH                       equ 0001h
PMCON1_LWLO_MASK                         equ 0020h
PMCON1_CFGS_POSN                         equ 0006h
PMCON1_CFGS_POSITION                     equ 0006h
PMCON1_CFGS_SIZE                         equ 0001h
PMCON1_CFGS_LENGTH                       equ 0001h
PMCON1_CFGS_MASK                         equ 0040h

// Register: PMCON2
#define PMCON2 PMCON2
PMCON2                                   equ 0196h
// bitfield definitions
PMCON2_PMCON2_POSN                       equ 0000h
PMCON2_PMCON2_POSITION                   equ 0000h
PMCON2_PMCON2_SIZE                       equ 0008h
PMCON2_PMCON2_LENGTH                     equ 0008h
PMCON2_PMCON2_MASK                       equ 00FFh

// Register: RC1REG
#define RC1REG RC1REG
RC1REG                                   equ 0199h
// bitfield definitions
RC1REG_RC1REG_POSN                       equ 0000h
RC1REG_RC1REG_POSITION                   equ 0000h
RC1REG_RC1REG_SIZE                       equ 0008h
RC1REG_RC1REG_LENGTH                     equ 0008h
RC1REG_RC1REG_MASK                       equ 00FFh

// Register: TX1REG
#define TX1REG TX1REG
TX1REG                                   equ 019Ah
// bitfield definitions
TX1REG_TX1REG_POSN                       equ 0000h
TX1REG_TX1REG_POSITION                   equ 0000h
TX1REG_TX1REG_SIZE                       equ 0008h
TX1REG_TX1REG_LENGTH                     equ 0008h
TX1REG_TX1REG_MASK                       equ 00FFh

// Register: SP1BRGL
#define SP1BRGL SP1BRGL
SP1BRGL                                  equ 019Bh
// bitfield definitions
SP1BRGL_BRG0_POSN                        equ 0000h
SP1BRGL_BRG0_POSITION                    equ 0000h
SP1BRGL_BRG0_SIZE                        equ 0001h
SP1BRGL_BRG0_LENGTH                      equ 0001h
SP1BRGL_BRG0_MASK                        equ 0001h
SP1BRGL_BRG1_POSN                        equ 0001h
SP1BRGL_BRG1_POSITION                    equ 0001h
SP1BRGL_BRG1_SIZE                        equ 0001h
SP1BRGL_BRG1_LENGTH                      equ 0001h
SP1BRGL_BRG1_MASK                        equ 0002h
SP1BRGL_BRG2_POSN                        equ 0002h
SP1BRGL_BRG2_POSITION                    equ 0002h
SP1BRGL_BRG2_SIZE                        equ 0001h
SP1BRGL_BRG2_LENGTH                      equ 0001h
SP1BRGL_BRG2_MASK                        equ 0004h
SP1BRGL_BRG3_POSN                        equ 0003h
SP1BRGL_BRG3_POSITION                    equ 0003h
SP1BRGL_BRG3_SIZE                        equ 0001h
SP1BRGL_BRG3_LENGTH                      equ 0001h
SP1BRGL_BRG3_MASK                        equ 0008h
SP1BRGL_BRG4_POSN                        equ 0004h
SP1BRGL_BRG4_POSITION                    equ 0004h
SP1BRGL_BRG4_SIZE                        equ 0001h
SP1BRGL_BRG4_LENGTH                      equ 0001h
SP1BRGL_BRG4_MASK                        equ 0010h
SP1BRGL_BRG5_POSN                        equ 0005h
SP1BRGL_BRG5_POSITION                    equ 0005h
SP1BRGL_BRG5_SIZE                        equ 0001h
SP1BRGL_BRG5_LENGTH                      equ 0001h
SP1BRGL_BRG5_MASK                        equ 0020h
SP1BRGL_BRG6_POSN                        equ 0006h
SP1BRGL_BRG6_POSITION                    equ 0006h
SP1BRGL_BRG6_SIZE                        equ 0001h
SP1BRGL_BRG6_LENGTH                      equ 0001h
SP1BRGL_BRG6_MASK                        equ 0040h
SP1BRGL_BRG7_POSN                        equ 0007h
SP1BRGL_BRG7_POSITION                    equ 0007h
SP1BRGL_BRG7_SIZE                        equ 0001h
SP1BRGL_BRG7_LENGTH                      equ 0001h
SP1BRGL_BRG7_MASK                        equ 0080h

// Register: SP1BRGH
#define SP1BRGH SP1BRGH
SP1BRGH                                  equ 019Ch
// bitfield definitions
SP1BRGH_BRG8_POSN                        equ 0000h
SP1BRGH_BRG8_POSITION                    equ 0000h
SP1BRGH_BRG8_SIZE                        equ 0001h
SP1BRGH_BRG8_LENGTH                      equ 0001h
SP1BRGH_BRG8_MASK                        equ 0001h
SP1BRGH_BRG9_POSN                        equ 0001h
SP1BRGH_BRG9_POSITION                    equ 0001h
SP1BRGH_BRG9_SIZE                        equ 0001h
SP1BRGH_BRG9_LENGTH                      equ 0001h
SP1BRGH_BRG9_MASK                        equ 0002h
SP1BRGH_BRG10_POSN                       equ 0002h
SP1BRGH_BRG10_POSITION                   equ 0002h
SP1BRGH_BRG10_SIZE                       equ 0001h
SP1BRGH_BRG10_LENGTH                     equ 0001h
SP1BRGH_BRG10_MASK                       equ 0004h
SP1BRGH_BRG11_POSN                       equ 0003h
SP1BRGH_BRG11_POSITION                   equ 0003h
SP1BRGH_BRG11_SIZE                       equ 0001h
SP1BRGH_BRG11_LENGTH                     equ 0001h
SP1BRGH_BRG11_MASK                       equ 0008h
SP1BRGH_BRG12_POSN                       equ 0004h
SP1BRGH_BRG12_POSITION                   equ 0004h
SP1BRGH_BRG12_SIZE                       equ 0001h
SP1BRGH_BRG12_LENGTH                     equ 0001h
SP1BRGH_BRG12_MASK                       equ 0010h
SP1BRGH_BRG13_POSN                       equ 0005h
SP1BRGH_BRG13_POSITION                   equ 0005h
SP1BRGH_BRG13_SIZE                       equ 0001h
SP1BRGH_BRG13_LENGTH                     equ 0001h
SP1BRGH_BRG13_MASK                       equ 0020h
SP1BRGH_BRG14_POSN                       equ 0006h
SP1BRGH_BRG14_POSITION                   equ 0006h
SP1BRGH_BRG14_SIZE                       equ 0001h
SP1BRGH_BRG14_LENGTH                     equ 0001h
SP1BRGH_BRG14_MASK                       equ 0040h
SP1BRGH_BRG15_POSN                       equ 0007h
SP1BRGH_BRG15_POSITION                   equ 0007h
SP1BRGH_BRG15_SIZE                       equ 0001h
SP1BRGH_BRG15_LENGTH                     equ 0001h
SP1BRGH_BRG15_MASK                       equ 0080h

// Register: RC1STA
#define RC1STA RC1STA
RC1STA                                   equ 019Dh
// bitfield definitions
RC1STA_RX9D_POSN                         equ 0000h
RC1STA_RX9D_POSITION                     equ 0000h
RC1STA_RX9D_SIZE                         equ 0001h
RC1STA_RX9D_LENGTH                       equ 0001h
RC1STA_RX9D_MASK                         equ 0001h
RC1STA_OERR_POSN                         equ 0001h
RC1STA_OERR_POSITION                     equ 0001h
RC1STA_OERR_SIZE                         equ 0001h
RC1STA_OERR_LENGTH                       equ 0001h
RC1STA_OERR_MASK                         equ 0002h
RC1STA_FERR_POSN                         equ 0002h
RC1STA_FERR_POSITION                     equ 0002h
RC1STA_FERR_SIZE                         equ 0001h
RC1STA_FERR_LENGTH                       equ 0001h
RC1STA_FERR_MASK                         equ 0004h
RC1STA_ADDEN_POSN                        equ 0003h
RC1STA_ADDEN_POSITION                    equ 0003h
RC1STA_ADDEN_SIZE                        equ 0001h
RC1STA_ADDEN_LENGTH                      equ 0001h
RC1STA_ADDEN_MASK                        equ 0008h
RC1STA_CREN_POSN                         equ 0004h
RC1STA_CREN_POSITION                     equ 0004h
RC1STA_CREN_SIZE                         equ 0001h
RC1STA_CREN_LENGTH                       equ 0001h
RC1STA_CREN_MASK                         equ 0010h
RC1STA_SREN_POSN                         equ 0005h
RC1STA_SREN_POSITION                     equ 0005h
RC1STA_SREN_SIZE                         equ 0001h
RC1STA_SREN_LENGTH                       equ 0001h
RC1STA_SREN_MASK                         equ 0020h
RC1STA_RX9_POSN                          equ 0006h
RC1STA_RX9_POSITION                      equ 0006h
RC1STA_RX9_SIZE                          equ 0001h
RC1STA_RX9_LENGTH                        equ 0001h
RC1STA_RX9_MASK                          equ 0040h
RC1STA_SPEN_POSN                         equ 0007h
RC1STA_SPEN_POSITION                     equ 0007h
RC1STA_SPEN_SIZE                         equ 0001h
RC1STA_SPEN_LENGTH                       equ 0001h
RC1STA_SPEN_MASK                         equ 0080h

